stm32duino/Arduino_Core_STM32/boards.txt
GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Generic L0
GenL0.name=Generic STM32L0 series

GenL0.build.vid=0x0483
GenL0.build.core=arduino
GenL0.build.board=GenL0
GenL0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenL0.build.mcu=cortex-m0plus
GenL0.build.series=STM32L0xx
GenL0.build.cmsis_lib_gcc=arm_cortexM0l_math

# ThunderPack
GenL0.menu.pnum.THUNDER_PACK=ThunderPack
GenL0.menu.pnum.THUNDER_PACK.upload.maximum_size=196608
GenL0.menu.pnum.THUNDER_PACK.upload.maximum_data_size=20480
GenL0.menu.pnum.THUNDER_PACK.build.board=THUNDER_PACK
GenL0.menu.pnum.THUNDER_PACK.build.product_line=STM32L072xx
GenL0.menu.pnum.THUNDER_PACK.build.variant=THUNDER_PACK

# Upload menu
GenL0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL0.menu.upload_method.swdMethod.upload.protocol=0
GenL0.menu.upload_method.swdMethod.upload.options=-g
GenL0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL0.menu.upload_method.serialMethod.upload.protocol=1
GenL0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL0.menu.upload_method.dfuMethod.upload.protocol=2
GenL0.menu.upload_method.dfuMethod.upload.options=-g
GenL0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL0.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################
# Electronic Speed Controller boards

ESC_board.name=Electronic speed controllers

ESC_board.build.vid=0x0483
ESC_board.build.core=arduino
ESC_board.build.board=FCE_board
ESC_board.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Wraith32_V1 board
ESC_board.menu.pnum.Wraith32_V1=Wraith V1 ESC
ESC_board.menu.pnum.Wraith32_V1.upload.maximum_size=32768
ESC_board.menu.pnum.Wraith32_V1.upload.maximum_data_size=7936
ESC_board.menu.pnum.Wraith32_V1.build.mcu=cortex-m0
ESC_board.menu.pnum.Wraith32_V1.build.board=Wraith32_V1
ESC_board.menu.pnum.Wraith32_V1.build.series=STM32F0xx
ESC_board.menu.pnum.Wraith32_V1.build.product_line=STM32F051x8
ESC_board.menu.pnum.Wraith32_V1.build.variant=WRAITH32_F051K6
ESC_board.menu.pnum.Wraith32_V1.build.cmsis_lib_gcc=arm_cortexM0l_math

# Upload menu
ESC_board.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
ESC_board.menu.upload_method.swdMethod.upload.protocol=0
ESC_board.menu.upload_method.swdMethod.upload.options=-g
ESC_board.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
ESC_board.menu.upload_method.serialMethod.upload.protocol=1
ESC_board.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
ESC_board.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
ESC_board.menu.upload_method.dfuMethod.upload.protocol=2
ESC_board.menu.upload_method.dfuMethod.upload.options=-g
ESC_board.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# LoRa boards

LoRa.name=LoRa boards

LoRa.build.vid=0x0483
LoRa.build.core=arduino
LoRa.build.board=LoRa
LoRa.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# RAK811_TRACKER board
LoRa.menu.pnum.RAK811_TRACKER=RAK811 LoRa Tracker (16kb RAM)
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_data_size=16384
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKER.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKER.build.board=RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKER.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKER.build.product_line=STM32L151xB
LoRa.menu.pnum.RAK811_TRACKER.build.variant=RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKER.build.cmsis_lib_gcc=arm_cortexM3l_math

LoRa.menu.pnum.RAK811_TRACKERA=RAK811 LoRa Tracker (32kb RAM)
LoRa.menu.pnum.RAK811_TRACKERA.upload.maximum_data_size=32768
LoRa.menu.pnum.RAK811_TRACKERA.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKERA.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKERA.build.board=RAK811_TRACKERA
LoRa.menu.pnum.RAK811_TRACKERA.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKERA.build.product_line=STM32L151xBA
LoRa.menu.pnum.RAK811_TRACKERA.build.variant=RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKERA.build.cmsis_lib_gcc=arm_cortexM3l_math

# RHF76_052 board
LoRa.menu.pnum.RHF76_052=RHF76 052
LoRa.menu.pnum.RHF76_052.upload.maximum_size=65536
LoRa.menu.pnum.RHF76_052.upload.maximum_data_size=8192
LoRa.menu.pnum.RHF76_052.build.mcu=cortex-m0plus
LoRa.menu.pnum.RHF76_052.build.board=RHF76_052
LoRa.menu.pnum.RHF76_052.build.series=STM32L0xx
LoRa.menu.pnum.RHF76_052.build.product_line=STM32L051xx
LoRa.menu.pnum.RHF76_052.build.variant=RHF76_052
LoRa.menu.pnum.RHF76_052.build.cmsis_lib_gcc=arm_cortexM0l_math
LoRa.menu.pnum.RHF76_052.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# Upload menu
LoRa.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
LoRa.menu.upload_method.swdMethod.upload.protocol=0
LoRa.menu.upload_method.swdMethod.upload.options=-g
LoRa.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

LoRa.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
LoRa.menu.upload_method.serialMethod.upload.protocol=1
LoRa.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
LoRa.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

