stm32duino/Arduino_Core_STM32/boards.txt
Genericflight.name=Generic flight controllers

Genericflight.build.vid=0x0483
Genericflight.build.core=arduino
Genericflight.build.board=Genericflight
Genericflight.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

# AfroFlight Rev5
Genericflight.menu.pnum.AFROFLIGHT_F103CB=Afro Flight Rev5 (8MHz)
Genericflight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_size=131072
Genericflight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_data_size=20480
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.mcu=cortex-m3
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.series=STM32F1xx
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.board=AFROFLIGHT_F103CB
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.product_line=STM32F103xB
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.variant=AFROFLIGHT_F103CB

Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M=Afro Flight Rev5 (12MHz)
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_size=131072
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_data_size=20480
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.mcu=cortex-m3
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.series=STM32F1xx
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.cmsis_lib_gcc=arm_cortexM3l_math
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.board=AFROFLIGHT_F103CB_12M
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.product_line=STM32F103xB
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.variant=AFROFLIGHT_F103CB

# Sparky_V1 board
Genericflight.menu.pnum.Sparky_V1=Sparky V1 F303 FC
Genericflight.menu.pnum.Sparky_V1.upload.maximum_size=262144
Genericflight.menu.pnum.Sparky_V1.upload.maximum_data_size=40960
Genericflight.menu.pnum.Sparky_V1.build.mcu=cortex-m4
Genericflight.menu.pnum.Sparky_V1.build.series=STM32F3xx
Genericflight.menu.pnum.Sparky_V1.build.cmsis_lib_gcc=arm_cortexM4lf_math
Genericflight.menu.pnum.Sparky_V1.build.board=Sparky_V1
Genericflight.menu.pnum.Sparky_V1.build.product_line=STM32F303xC
Genericflight.menu.pnum.Sparky_V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Genericflight.menu.pnum.Sparky_V1.build.variant=SPARKY_F303CC

# Upload menu
Genericflight.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Genericflight.menu.upload_method.swdMethod.upload.protocol=0
Genericflight.menu.upload_method.swdMethod.upload.options=-g
Genericflight.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Genericflight.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Genericflight.menu.upload_method.serialMethod.upload.protocol=1
Genericflight.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Genericflight.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Genericflight.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Genericflight.menu.upload_method.dfuMethod.upload.protocol=2
Genericflight.menu.upload_method.dfuMethod.upload.options=-g
Genericflight.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Genericflight.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Genericflight.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Genericflight.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Genericflight.menu.upload_method.hidMethod=HID Bootloader 2.2
Genericflight.menu.upload_method.hidMethod.upload.protocol=hid22
Genericflight.menu.upload_method.hidMethod.upload.tool=hid_upload
Genericflight.menu.upload_method.hidMethod.build.flash_offset=0x800
Genericflight.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

Genericflight.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
Genericflight.menu.upload_method.dfu2Method.upload.protocol=maple
Genericflight.menu.upload_method.dfu2Method.upload.tool=maple_upload
Genericflight.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
Genericflight.menu.upload_method.dfu2Method.upload.altID=2
Genericflight.menu.upload_method.dfu2Method.build.flash_offset=0x2000
Genericflight.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

Genericflight.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
Genericflight.menu.upload_method.dfuoMethod.upload.protocol=maple
Genericflight.menu.upload_method.dfuoMethod.upload.tool=maple_upload
Genericflight.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
Genericflight.menu.upload_method.dfuoMethod.upload.altID=1
Genericflight.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
Genericflight.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Midatronics boards

Midatronics.name=Midatronics boards

Midatronics.build.vid=0x0483
Midatronics.build.core=arduino
Midatronics.build.board=Midatronics
Midatronics.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# MKR_SHARKY board
Midatronics.menu.pnum.MKR_SHARKY=MKR Sharky
Midatronics.menu.pnum.MKR_SHARKY.node=NODE_WB55CE
Midatronics.menu.pnum.MKR_SHARKY.upload.maximum_size=524288
Midatronics.menu.pnum.MKR_SHARKY.upload.maximum_data_size=196604
Midatronics.menu.pnum.MKR_SHARKY.build.mcu=cortex-m4
Midatronics.menu.pnum.MKR_SHARKY.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Midatronics.menu.pnum.MKR_SHARKY.build.board=MKR_SHARKY
Midatronics.menu.pnum.MKR_SHARKY.build.series=STM32WBxx
Midatronics.menu.pnum.MKR_SHARKY.build.product_line=STM32WB55xx
Midatronics.menu.pnum.MKR_SHARKY.build.variant=MKR_SHARKY
Midatronics.menu.pnum.MKR_SHARKY.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Midatronics.menu.upload_method.MassStorage=Mass Storage
Midatronics.menu.upload_method.MassStorage.upload.protocol=
Midatronics.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Midatronics.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Midatronics.menu.upload_method.swdMethod.upload.protocol=0
Midatronics.menu.upload_method.swdMethod.upload.options=-g
Midatronics.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Midatronics.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Midatronics.menu.upload_method.serialMethod.upload.protocol=1
Midatronics.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Midatronics.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Midatronics.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Midatronics.menu.upload_method.dfuMethod.upload.protocol=2
Midatronics.menu.upload_method.dfuMethod.upload.options=-g
Midatronics.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Piconomix boards
Piconomix.name=Piconomix boards

Piconomix.build.vid=0x0483
Piconomix.build.core=arduino
Piconomix.build.board=Piconomix
Piconomix.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# PX-HER0
Piconomix.menu.pnum.PX-HER0=PX-HER0
Piconomix.menu.pnum.PX-HER0.node=NODE_L072RB
Piconomix.menu.pnum.PX-HER0.build.board=PX-HER0
Piconomix.menu.pnum.PX-HER0.build.mcu=cortex-m0plus
Piconomix.menu.pnum.PX-HER0.build.cmsis_lib_gcc=arm_cortexM0l_math
Piconomix.menu.pnum.PX-HER0.build.series=STM32L0xx
Piconomix.menu.pnum.PX-HER0.build.product_line=STM32L072xx
Piconomix.menu.pnum.PX-HER0.build.variant=PX-HER0
Piconomix.menu.pnum.PX-HER0.upload.maximum_size=131072
Piconomix.menu.pnum.PX-HER0.upload.maximum_data_size=20480

# Upload menu
Piconomix.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Piconomix.menu.upload_method.swdMethod.upload.protocol=0
Piconomix.menu.upload_method.swdMethod.upload.options=-g
Piconomix.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Piconomix.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Piconomix.menu.upload_method.serialMethod.upload.protocol=1
Piconomix.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Piconomix.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Piconomix.menu.upload_method.dfuMethod=STM32CubeProgrammer (USB)
Piconomix.menu.upload_method.dfuMethod.upload.protocol=2
Piconomix.menu.upload_method.dfuMethod.upload.options=-g
Piconomix.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

