stm32duino/Arduino_Core_STM32/boards.txt
# Serialx activation
Piconomix.menu.xserial.generic=Enabled (generic 'Serial')
Piconomix.menu.xserial.none=Enabled (no generic 'Serial')
Piconomix.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Piconomix.menu.xserial.disabled=Disabled (no Serial support)
Piconomix.menu.xserial.disabled.build.xSerial=

# USB connectivity
Piconomix.menu.usb.none=None
Piconomix.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Piconomix.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Piconomix.menu.usb.CDC=CDC (no generic 'Serial')
Piconomix.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Piconomix.menu.usb.HID=HID (keyboard and mouse)
Piconomix.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE

# Optimizations
Piconomix.menu.opt.osstd=Smallest (-Os default)
Piconomix.menu.opt.oslto=Smallest (-Os) with LTO
Piconomix.menu.opt.oslto.build.flags.optimize=-Os -flto
Piconomix.menu.opt.o1std=Fast (-O1)
Piconomix.menu.opt.o1std.build.flags.optimize=-O1
Piconomix.menu.opt.o1lto=Fast (-O1) with LTO
Piconomix.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Piconomix.menu.opt.o2std=Faster (-O2)
Piconomix.menu.opt.o2std.build.flags.optimize=-O2
Piconomix.menu.opt.o2lto=Faster (-O2) with LTO
Piconomix.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Piconomix.menu.opt.o3std=Fastest (-O3)
Piconomix.menu.opt.o3std.build.flags.optimize=-O3
Piconomix.menu.opt.o3lto=Fastest (-O3) with LTO
Piconomix.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Piconomix.menu.opt.ogstd=Debug (-g)
Piconomix.menu.opt.ogstd.build.flags.optimize=-g -Og

# C Runtime Library
Piconomix.menu.rtlib.nano=Newlib Nano (default)
Piconomix.menu.rtlib.nanofp=Newlib Nano + Float Printf
Piconomix.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Piconomix.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Piconomix.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Piconomix.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Piconomix.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Piconomix.menu.rtlib.full=Newlib Standard
Piconomix.menu.rtlib.full.build.flags.ldspecs=

################################################################################
# Serialx activation
Nucleo_144.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_144.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_144.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_144.menu.xserial.disabled.build.xSerial=

Nucleo_64.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_64.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Nucleo_32.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_32.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_32.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_32.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled (generic 'Serial')
Disco.menu.xserial.none=Enabled (no generic 'Serial')
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (no Serial support)
Disco.menu.xserial.disabled.build.xSerial=

Eval.menu.xserial.generic=Enabled (generic 'Serial')
Eval.menu.xserial.none=Enabled (no generic 'Serial')
Eval.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Eval.menu.xserial.disabled=Disabled (no Serial support)
Eval.menu.xserial.disabled.build.xSerial=

STM32MP1.menu.xserial.generic=UART only (generic 'Serial')
STM32MP1.menu.xserial.generic.build.xSerial=-DHAL_UART_MODULE_ENABLED
STM32MP1.menu.xserial.none=UART only (no generic 'Serial')
STM32MP1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
STM32MP1.menu.xserial.disabled=Disabled (no Serial support)
STM32MP1.menu.xserial.disabled.build.xSerial=

GenF0.menu.xserial.generic=Enabled (generic 'Serial')
GenF0.menu.xserial.none=Enabled (no generic 'Serial')
GenF0.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF0.menu.xserial.disabled=Disabled (no Serial support)
GenF0.menu.xserial.disabled.build.xSerial=

GenF1.menu.xserial.generic=Enabled (generic 'Serial')
GenF1.menu.xserial.none=Enabled (no generic 'Serial')
GenF1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF1.menu.xserial.disabled=Disabled (no Serial support)
GenF1.menu.xserial.disabled.build.xSerial=

GenF3.menu.xserial.generic=Enabled (generic 'Serial')
GenF3.menu.xserial.none=Enabled (no generic 'Serial')
GenF3.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF3.menu.xserial.disabled=Disabled (no Serial support)
GenF3.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled (generic 'Serial')
GenF4.menu.xserial.none=Enabled (no generic 'Serial')
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (no Serial support)
GenF4.menu.xserial.disabled.build.xSerial=

GenL0.menu.xserial.generic=Enabled (generic 'Serial')
GenL0.menu.xserial.none=Enabled (no generic 'Serial')
GenL0.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenL0.menu.xserial.disabled=Disabled (no Serial support)
GenL0.menu.xserial.disabled.build.xSerial=

ESC_board.menu.xserial.generic=Enabled (generic 'Serial')
ESC_board.menu.xserial.none=Enabled (no generic 'Serial')
ESC_board.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
ESC_board.menu.xserial.disabled=Disabled (no Serial support)
ESC_board.menu.xserial.disabled.build.xSerial=

LoRa.menu.xserial.generic=Enabled (generic 'Serial')
LoRa.menu.xserial.none=Enabled (no generic 'Serial')
LoRa.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
LoRa.menu.xserial.disabled=Disabled (no Serial support)
LoRa.menu.xserial.disabled.build.xSerial=

3dprinter.menu.xserial.generic=Enabled (generic 'Serial')
3dprinter.menu.xserial.none=Enabled (no generic 'Serial')
3dprinter.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
3dprinter.menu.xserial.disabled=Disabled (no Serial support)
3dprinter.menu.xserial.disabled.build.xSerial=

